stm32-rs/stm32f4xx-hal/src/i2c.rs
#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PB15<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PD12<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PB13<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PD14<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PD15<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PF14<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C> for PF15<AlternateOD<AF4>> {}

#[derive(Debug)]
pub enum Error {
    OVERRUN,
    NACK,
    TIMEOUT,
    BUS,
    CRC,
    ARBITRATION,
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> I2c<I2C1, PINS> {
    pub fn i2c1(i2c: I2C1, pins: PINS, speed: KiloHertz, clocks: Clocks) -> Self
    where
        PINS: Pins<I2C1>,
    {
        unsafe {
            const EN_BIT: u8 = 21;
            const RESET_BIT: u8 = 21;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            bb::set(&rcc.apb1enr, EN_BIT);
            bb::set(&rcc.apb1rstr, RESET_BIT);
            bb::clear(&rcc.apb1rstr, RESET_BIT);
        }

        let i2c = I2c { i2c, pins };
        i2c.i2c_init(speed, clocks.pclk1());
        i2c
    }
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> I2c<I2C2, PINS> {
    pub fn i2c2(i2c: I2C2, pins: PINS, speed: KiloHertz, clocks: Clocks) -> Self
    where
        PINS: Pins<I2C2>,
    {
        unsafe {
            const EN_BIT: u8 = 22;
            const RESET_BIT: u8 = 22;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            bb::set(&rcc.apb1enr, EN_BIT);
            bb::set(&rcc.apb1rstr, RESET_BIT);
            bb::clear(&rcc.apb1rstr, RESET_BIT);
        }

        let i2c = I2c { i2c, pins };
        i2c.i2c_init(speed, clocks.pclk1());
        i2c
    }
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> I2c<I2C3, PINS> {
    pub fn i2c3(i2c: I2C3, pins: PINS, speed: KiloHertz, clocks: Clocks) -> Self
    where
        PINS: Pins<I2C3>,
    {
        unsafe {
            const EN_BIT: u8 = 23;
            const RESET_BIT: u8 = 23;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            bb::set(&rcc.apb1enr, EN_BIT);
            bb::set(&rcc.apb1rstr, RESET_BIT);
            bb::clear(&rcc.apb1rstr, RESET_BIT);
        }

        let i2c = I2c { i2c, pins };
        i2c.i2c_init(speed, clocks.pclk1());
        i2c
    }
}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl<PINS> FMPI2c<FMPI2C, PINS> {
    pub fn fmpi2c(i2c: FMPI2C, pins: PINS, speed: KiloHertz) -> Self
    where
        PINS: Pins<FMPI2C>,
    {
        unsafe {
            const EN_BIT: u8 = 24;
            const RESET_BIT: u8 = 24;
            const CLKSEL_0: u8 = 22;
            const CLKSEL_1: u8 = 23;

            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            bb::set(&rcc.apb1enr, EN_BIT);
            bb::set(&rcc.apb1rstr, RESET_BIT);
            bb::clear(&rcc.apb1rstr, RESET_BIT);

            // Select source clock. This is suboptimal, we're doing two writes to select a field,
            // but we can do this because all combinations are valid and the intermediate state is
            // already the state we want or the reset state.
            bb::clear(&rcc.dckcfgr2, CLKSEL_0);
            bb::set(&rcc.dckcfgr2, CLKSEL_1);
        }

        let i2c = FMPI2c { i2c, pins };
        i2c.i2c_init(speed);
        i2c
    }
}

impl<I2C, PINS> I2c<I2C, PINS>
where
    I2C: Deref<Target = i2c1::RegisterBlock>,
{
    fn i2c_init(&self, speed: KiloHertz, pclk: Hertz) {
        let speed: Hertz = speed.into();

        // Make sure the I2C unit is disabled so we can configure it
        self.i2c.cr1.modify(|_, w| w.pe().clear_bit());

        // Calculate settings for I2C speed modes
        let clock = pclk.0;
        let freq = clock / 1_000_000;
        assert!(freq >= 2 && freq <= 50);

        // Configure bus frequency into I2C peripheral
        self.i2c.cr2.write(|w| unsafe { w.freq().bits(freq as u8) });

        let trise = if speed <= 100.khz().into() {
            freq + 1
        } else {
            (freq * 300) / 1000 + 1
        };

        // Configure correct rise times
        self.i2c.trise.write(|w| w.trise().bits(trise as u8));

        // I2C clock control calculation
        if speed <= 100.khz().into() {
            let ccr = {
                let ccr = clock / (speed.0 * 2);
                if ccr < 4 {
                    4
                } else {
                    ccr
                }
            };

            // Set clock to standard mode with appropriate parameters for selected speed
            self.i2c.ccr.write(|w| unsafe {
                w.f_s()
                    .clear_bit()
                    .duty()
                    .clear_bit()
                    .ccr()
                    .bits(ccr as u16)
            });
        } else {
            const DUTYCYCLE: u8 = 0;
            if DUTYCYCLE == 0 {
                let ccr = clock / (speed.0 * 3);
                let ccr = if ccr < 1 { 1 } else { ccr };

                // Set clock to fast mode with appropriate parameters for selected speed (2:1 duty cycle)
                self.i2c.ccr.write(|w| unsafe {
                    w.f_s().set_bit().duty().clear_bit().ccr().bits(ccr as u16)
                });
            } else {
                let ccr = clock / (speed.0 * 25);
                let ccr = if ccr < 1 { 1 } else { ccr };

